read_verilog -sv /home/hongce/ila/ILA-Tools/test/unit-data/vpipe/inv-syn/SUB/wrapper.v
prep -top wrapper

hierarchy -check
proc
opt
opt_expr -mux_undef
opt
opt
memory -nordff
proc
opt;;
write_smt2 -mem -bv -wires -stdt /home/hongce/ila/ILA-Tools/test/unit-data/vpipe/inv-syn/SUB/__design_smt.smt2