read_verilog -sv /home/hongce/ila/ILA-Tools/test/unit-data/inv_syn/out/INC/wrapper.v
prep -top wrapper

hierarchy -check
proc
opt
opt_expr -mux_undef
opt
opt
memory -nordff
proc
opt;;
write_smt2 -mem -bv -wires -stdt /home/hongce/ila/ILA-Tools/test/unit-data/inv_syn/out/INC/__design_smt.smt2